# CalculatedCoolingLoad Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..CalculatedCoolingLoad Property
Space Class See Also
---
Get the Calculated Cooling Load of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double CalculatedCoolingLoad { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CalculatedCoolingLoad As Double
	Get
```

Visual C++
---
```text
public:
property double CalculatedCoolingLoad {
	double get ();
}
```

# Remarks
This property is used to get the Calculated Cooling Load of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace